
/* 
При сдаче домашней работы дать ссылку на исходные файлы в 
репозитории Каждое задание должно быть выполнено в отдельном 
файле с именем task-номер_задания.js. Используй <script type="module"> 
чтобы закрыть код задания в отдельной области видимости и 
избежать конфликтов имен идентификаторов. Имена переменных понятные, 
описательные Код отформатирован с помощью Prettier

Задание 1
Объяви две переменные хранящие название и цену товара: name и price 
Присвой переменным следующие характеристики товара (сразу при объявлении) название: 
Генератор защитного поля цена: 1000 Используя шаблонную строку выведи в 
консоль информацию о товаре, получится: 'Выбран «Генератор защитного поля»,
 цена за штуку 1000 кредитов'. Присвой товару новую цену - 2000 
 Используя шаблонную строку выведи в консоль информацию о товаре, получится: 
 'Выбран «Генератор защитного поля», цена за штуку 2000 кредитов'.
*/



/*let name1 = 'Генератор защитного поля цена: 1000 кредитов';
console.log(name1)

let name2 = 'Генератор защитного поля цена: 2000 кредитов';
console.log(name2)*/

let named = '"Генератор защитного поля"';
let price = 'цена за шт. 1000 кредитов';
let price2 = 'цена за шт. 2000 кредитов';

console.log(named, price)
console.log(named, price2)


